Repository: AigizK/bashkort-parallel-corpora
Catalog: tmx/215.Диалог с Андреем без башкирского текста.tmx
Source language: ru
Languages: ba

source: Привет.
ba: Сәләм

source: Ну, самое главное, что башкирский язык есть в Яндекс.Переводчике, правда в бета-версии.
ba: Иң мөһиме, башҡорт теле Яндекста бар. Тәржемәлә бета версияла ғына.

source: Марийский язык тоже пока бета.
ba: Мари теле лә әле бетала ғына

source: Мы начали работу по включению марийского языка в Яндекс.Переводчик в июне этого года.
ba: Беҙ Яндекс.Переводчикҡа мари телен индереүҙе быйылғы йылдың июнендә генә башлағайныҡ

source: 5 сентября он уже стал бета.
ba: 5 сентябрь ул бетаға әйләнде

source: Сейчас работаем, чтобы довести переводчик до финального релиза.
ba: Әлеге ваҡытта беҙ преводчикты финал релизына еткереү өҫтөнән эшләйбеҙ.

source: Там собственно работа-то несложная, просто рутинная...
ba: Унда эш ҡыйын түгел былай, тик мәшәҡәтле.

source: С чего начать?
ba: Нимәнән башларға?

source: Нам нужны будут тексты на русском и башкирском языках, то есть переводы
ba: Беҙгә рус һәм башҡорт телендәге тексттар кәрәк буласаҡ, йәғни тәржемәләр.

source: Если все используют Windows, то предлагаю использовать программу для выравнивания параллельных текстов программу Abbyy Aligner
ba: Әгәр бөтәһе лә Windows ҡулланһа, тексттарҙы тигеҙләр өсөн Abbyy Aligner программаһын ҡулланырға кәңәш итәм.

source: Как получить бесплатно лицензию на эту программу?
ba: Был программаға нисек бушлай лицензия алырға?

source: Нужно зарегистрироваться как переводчик-фрилансер на сайте https://smartcat.ai/, заполнить информацию о себе.
ba: https://smartcat.ai/ сайтында переводчик-фрилансер кеүек танылырға һәм үҙең тураһында мәғлүмәтте индерер кәрәк.

source: Потом написать письмо в суппорт и сказать, дайте пожалуйста лицензию на программу Abbyy Aligner, и они дают
ba: Унан һуң саппортҡа Abbyy Aligner программаһына зинһар өсөн лицензия бирегеҙ тип хат яҙыр кәрәк, һәм улар бирәләр.

source: адрес саппорта: support@smartcat.ai
ba: Саппорт адресы: support@smartcat.ai

source: также они дают ссылку на скачивание этой программы
ba: Улар тағы ла ошо программаны йөкләргә ссылканы бирәләр.

source: Что такое выравненные параллельные тексты?
ba: Параллель тексттарҙы тигеҙләү нимә ул?

source: Это по сути таблица, где "а, кемде күрәм!" соответствует: "о, кого я вижу!", а "а, ҡайҙан килеп сыҡты?" соответствует: "о, откуда взялся?" и так далее...
ba: "О, кого вижу!" һүҙбәйләнеше "а, кемде күрәм", ә "о, откуда взялся?" һүҙбәйләнеше "а, ҡайҙан килеп сыҡты" һүҙбәйләнешенә тап килгән таблица.

source: Где брать тексты на 2-х языках?
ba: 2 телдәге тексттарҙы ҡайҙан алырға?

source: 1) в театрах, например, им. Гафури есть тексты пьес на башкирском и русском языках
ba: 1) театрҙарҙа, мәҫәлән, Ғафури исемендәгеһендә пьесалар башҡорт һәм рус телендә лә бар

source: 2) законы и постановления, которые издаются на башкирском языке, к нему есть тексты на русском языке
ba: 2)Башҡорт телендә сыҡҡан закондар һәм ҡарарҙар. Уларға рус телендә тексттар бар.

source: 3) у профессиональных переводчиков.
ba: 3) профессиональ тәржемәселәрҙән

source: 4) обращайтесь в редакции дубляжных газет.
ba: 4) ике телдә лә сыҡҡан гәзит редакцияларына мөрәжәғәт итегеҙ

source: 5) переводная литература
ba: 5) тәржемә ителгән әҙәбиәт

source: 6) с сайтов сми и официальных органов, где тексты и на башкирском и на русском языках
ba: 6) сми һәм официаль органдарҙың сайтынан ашҡорт һәм рус телдәрендә булған тексттарҙы

source: Соблюдать последовательность не обязательно.
ba: Эҙмә-эҙлелекте һаҡлау мотлаҡ түгел.

source: Главное найти параллельные тексты и их выровнять
ba: Иң мөһиме - параллел тексттарҙы табып, уларҙы тигеҙләү
